print('''
        (()__(()
        /       \\
       ( /    \\  \\
        \\ o o    /
        (_()_)__/ \\
       / _,==.____ \\
      (   |--|      )
      /\\_.|__|'-.__/\\_
     / (        /     \\
     \\  \\      (      /
      )  '._____)    /
   (((____.--(((____/''')

print('''
........      ........      ........      ..    ..
........      ........      ........      ..    ..
..               ..            ..         ..    ..
........         ..            ..         ..    ..
........         ..            ..         ..    ..
      ..      .. ..            ..         ..    ..
........      .. ..            ..         ........
........      .....            ..         ........''')  

print('''
*        
    *   
 *      
     *  
  *      
      * 
   *    
       *''')

print('''
                      忆江南
                作者：白居易 年代：唐
江南好，风景旧曾谙。日出江花红胜火，春来江水绿如蓝。能不忆江南？ 　　
江南忆，最忆是杭州。山寺月中寻桂子，郡亭枕上看潮头。何日更重游？ 　　
江南忆，其次忆吴宫。吴酒一杯春竹叶，吴娃双舞醉芙蓉。早晚复相逢？''')

a=int(3)
b=int(4)
c=int(3)
p=(a+b+c)/2
s=(p*(p-a)*(p-b)*(p-c))**0.5
print(s)

a=int(1)
b=int(1)
c=int(1)
p=(a+b+c)/2
s=(p*(p-a)*(p-b)*(p-c))**0.5
print(s)

a=int(2)
b=int(3)
c=int(2)
p=(a+b+c)/2
s=(p*(p-a)*(p-b)*(p-c))**0.5
print(s)

a=int(3)
b=int(3)
c=int(1)
p=(a+b+c)/2
s=(p*(p-a)*(p-b)*(p-c))**0.5
print(s)

import numpy as np
matrix_3x3 = np.array([[1,0.1,0.1],
                       [1,0.3,0.3],
                       [1,0.4,0.5]])
det_3x3 = np.linalg.det(matrix_3x3)
s=(det_3x3)/2
print(s)

a=int(1)
b=int(2)
c=int(-1)
x1=(-b+(b**2-4*a*c)**0.5)/(2*a)
x2=(-b-(b**2-4*a*c)**0.5)/(2*a)
print(x1,x2)

a=int(1)
b=int(1)
c=int(1)
x=-b/(2*a)
m=a*x**2+b*x+c
print(m)

a=int(-1)
b=int(1)
c=int(1)
x=-b/(2*a)
m=a*x**2+b*x+c
print(m)